Revit 2027 API
BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeTypeRefsWarning Property
 Cannot create reference objects for a DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateDirectShapeTypeRefsWarning { get; }
Public Shared ReadOnly Property CannotCreateDirectShapeTypeRefsWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateDirectShapeTypeRefsWarning {
	FailureDefinitionId^ get ();
}
static member CannotCreateDirectShapeTypeRefsWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DirectShapeFailures Class
Autodesk.Revit.DB Namespace